{
  "intro": {
    "text": [
      {
        "type": "text",
        "value": "Description for article (the one that shows up in google search)/ for Social Media: Got dietary restrictions? This guide to eating vegan and gluten-free in Philadelphia is for you - even if your friends are cheesesteak-loving carnivores."
      },
      {
        "type": "text",
        "value": "Philadelphia, home of the cheesesteak, the soft pretzel, and <a href=\"https://readingterminalmarket.org/merchant/bassetts-ice-cream/\">America’s ice cream maker</a>, may not seem like the most welcoming place to the dietary-restricted eater — the many who must pass on pizza, go without grilled cheese, or abstain from asada. They’re the same people who have spent meals cajoling their partners into eating tofu or selling their families on the merits of almond-flour brownies. We feel your pain."
      },
      {
        "type": "text",
        "value": "But Philly is actually a haven for this crowd — it’s also home to a heap of vegan cheesesteaks (<a href=\"https://www.inquirer.com/philly/food/20160324_All_the_dish_from_the_3rd_annual_Best_Vegan_Cheesesteak_in_Philly_contest.html\">enough to hold a contest</a>), gluten-free cupcakes, and at least one stellar dairy-free shake."
      },
      {
        "type": "text",
        "value": "So we’ve crafted a guide with the dietary-restricted eater and their omnivorous friends in mind. This list is full of restaurants, cafes, and bars with a number of vegan, dairy-free, or gluten-free offerings as well as dishes like pepperoni pizza and juicy, non-soy-based burgers."
      },
      {
        "type": "text",
        "value": "Use the filters to sort the list by type of diet as well as neighborhood. Other things to keep in mind:"
      },
      {
        "type": "text",
        "value": "* All of the following restaurants either offer a separate menu for dietary restrictions, have several items appropriate for that restriction, or can alter a standard offering to make it suitable."
      },
      {
        "type": "text",
        "value": "* Nearly all of the restaurants with the gluten-free filter also offer some delicious, 100-percent wheat bread and pasta options as well."
      },
      {
        "type": "text",
        "value": "* The ‘carnivore-friendly’ label shows restaurants that serve meat; some restaurants will be both “vegan” and “carnivore-friendly,” meaning they cater to both crowds."
      },
      {
        "type": "text",
        "value": "Editor’s note: Restaurants marked gluten-free offer dishes without containing gluten, but we cannot certify that there is no cross-contamination from shared prep surfaces and airborne allergens. If you have a severe intolerance or allergy, please notify the restaurant."
      }
    ]
  },
  "restaurants-list": {
    "restaurants": [
      {
        "Name": "Goldie",
        "Filters": "Vegan, Dairy-free",
        "Instagram": "<a href=\"https://www.instagram.com/p/By8ATUxgcip/?igshid=1ppe682139sfc\">https://www.instagram.com/p/By8ATUxgcip/?igshid=1ppe682139sfc</a>",
        "Dishes_to_try": "Tehina shakes, falafel sandwiches and salads",
        "Go_for": "Lunch or a quick, casual dinner.",
        "Something_to_note": "Owned by Michael Solomonov and Steve Cook — the same award-winning team behind Zahav, Federal Donuts, and Abe Fisher — Goldie is 100 percent vegan and kosher and exceptionally accommodating of dietary restrictions. The menu is small but interesting: fluffy-crisp falafel served in Dizengoff’s pillowy pita bread (or over chopped salad), shawarma-spiced fries, and sour cherry iced tea. Even the <a href=\"https://twitter.com/craiglaban/status/850036488683347969?lang=en\">addictively tasty</a> tehina milkshakes, which come in flavors like Turkish coffee and mint-chocolate, are dairy-free. Order at the counter for a quick pickup, and take your mediterranean feast to go, on dine in in the dimly lit space. Besides the eat-in space on Sansom Street, find Goldie at the Whole Foods’ food court on Pennsylvania Avenue as well as UPenn food hall Franklin’s Table.",
        "text": []
      },
      {
        "Name": "Tattooed Mom",
        "Address": "530 South St., Philadelphia, PA 19147",
        "Filters": "Vegan, Dairy-free",
        "Instagram": "<a href=\"https://www.instagram.com/p/ByOU-kSByXf/?igshid=9ih51aa66shg\">https://www.instagram.com/p/ByOU-kSByXf/?</a><a href=\"https://www.instagram.com/p/ByOU-kSByXf/?igshid=9ih51aa66shg\">igshid</a><a href=\"https://www.instagram.com/p/ByOU-kSByXf/?igshid=9ih51aa66shg\">=9ih51aa66shg</a>, <a href=\"https://www.instagram.com/p/BuEbPldndDy/?igshid=4y7wzglui8ox\">https://www.instagram.com/p/BuEbPldndDy/?igshid=4y7wzglui8ox</a>",
        "Image_credit": "sample credit",
        "Dishes_to_try": "Vegan jalapeno cheese whiz tots, fried pickle-topped “chickn” sammy, inventive drinks like the cotton candy-laced Cosmo Cloud",
        "Go_for": "A playful and affordable night out, especially on Meatless Mondays",
        "Something_to_note": "",
        "text": [
          {
            "type": "text",
            "value": "A South Street staple since 1997, Tattooed Mom’s kitchen turns out bar food for vegans and for carnivores (about half and half), making it the perfect hangout for eaters of all stripes. The vegan menu is thanks in part to staff members changing their own diets. Although it’s namesake caters to “cool moms,” this colorful bar is far from a parents spot. It has plenty of bar food that people with dietary restrictions can enjoy — there are even specials like Meatless Mondays (half off the full plant-based menu) and taco Tuesdays. It also boasts a late night happy hour from 10-11pm every day, perfect for a late night snack and drink. Make sure you check out their specials for the night before you go!"
          }
        ]
      },
      {
        "Name": "HipCityVeg",
        "Filters": "Vegan, Dairy-free, Gluten-free",
        "Dishes_to_try": "Try their banana whip (add multiple toppings for a sundae) and rendition of the Philly cheese steak plus their sweet potato fries and dairy free milkshakes",
        "Go_for": "A quick healthy lunch/dinner with a fellow vegan friend",
        "Something_to_note": "Although the chain is plentiful in the city, HipCityVeg is a reliable place to get a filling quick meal — but be warned, your friends who eat meat may not be fooled by their substitutes. Among their array of salad options, there are some unusual offerings worth a try, like their handful of burgers and milkshakes.",
        "Instagram": "<a href=\"https://www.instagram.com/p/BzycecAF6E5/?igshid=1ll528dabi6aq\">https://www.instagram.com/p/BzycecAF6E5/?igshid=1ll528dabi6aq</a>",
        "text": []
      },
      {
        "Name": "The Tasty",
        "Filters": "Vegan, Dairy-free, Gluten-free",
        "Dishes_to_try": "Try their waffles or their hearty and best-selling deluxe breakfast burrito. Co-owner Sofia Baltopoulos says you can order the deluxe burrito as a tot bowl —  the secret menu item is all of the fillings and toppings for the burrito served over a big bowl of tater tots.Their rotating pastry options are often a hit as well.",
        "Go_for": "A low-key breakfast or lunch with a classic diner no-frills vibe",
        "Something_to_note": "Baltopoulos said she noticed there were an abundance of diners in the area, but none with more than one or two vegan options. This prompted Baltopoulos and her business partner Kate to open the Tasty three years ago.The Tasty is 100% vegan, and also offers an additional gluten-free menu — not everything can be made gluten-free, but there a quite a few options, including gluten-free bread and buns.",
        "text": []
      },
      {
        "Name": "Dim Sum House by Jane G’s",
        "Filters": "Vegan, Dairy-free, Gluten-free, Carnivore-friendly",
        "Dishes_to_try": "Try their pad thai, scallion pancakes, and any dish with noodles for a filling evening!",
        "Go_for": "A nice dinner date is perfect for the low-lit restaurant",
        "Something_to_note": "The restaurant and bar offers both a vegan and gluten-free section at the back of their menu — in addition to the many veggies on the menu, there is an expansive selection of things to please everyone, from vegans to meat-eaters. Order a few dishes to share with the table!",
        "text": []
      },
      {
        "Name": "P.S. & Co.",
        "Filters": "Vegan, Dairy-free, Gluten-free",
        "Dishes_to_try": "Try their breakfast nachos and their brioche french toast. But honestly — most things on their menu are a hit. Don’t forget to stop by and grab a couple of their fresh baked pastries, but don’t be surprised when the check starts to add up!",
        "Go_for": "Although Pure Sweets and Company is open for all meals, brunch is definitely their main event. However, the airy and photogenic building doesn’t serve large groups entirely well — the building works best for a few friends, and make sure you guys make a reservation!",
        "Something_to_note": "Let your server know if you have any other restrictions, and they will happily help you out.",
        "text": [
          {
            "type": "text",
            "value": "P.S. and Co. is <a href=\"https://www.inquirer.com/philly/blogs/the-insider/Vegan-PS--Co-opens-in-Rittenhouse.html\">a godsend</a> for those with dietary restrictions. The Rittenhouse restaurant has a wide ranging breakfast and lunch menu that includes everything from flavorful breakfast tacos to hearty chocolate chip pancakes — all 100% vegan, gluten-free, kosher, and almost all organic."
          },
          {
            "type": "text",
            "value": "Andrea Kyan founded the restaurant after she went vegan in 2007, and found a lack of sweet things for her to eat — so she started experimenting. An eventual baking business grew into the small brick’d establishment in Rittenhouse that is packed for brunch on the weekends and prides itself on curated unrefined ingredients and take conscious steps towards sustainability. Interestingly, the restaurant avoids what they <a href=\"https://puresweets.com/pages/faq\">call</a> “unhealthful forms of soy and pea protein,” meaning they do not make or sell any processed fake meats. While those meats may be vegan, P.S. and Co says they are not the best health-wise, so they stick to plant-based materials from whole foods."
          }
        ]
      },
      {
        "Name": "Sweet Freedom Bakery",
        "Filters": "Vegan, Dairy-free, Gluten-free",
        "Dishes_to_try": "Try their Samoa cupcake if you love chocolate and coconut, or the Salted Carmel cupcake for even more chocolate. For something (very slightly) healthier, try one of their fruit oat crumble bars.",
        "Go_for": "a major sweet fix",
        "Something_to_note": "This is a great place to order some sweets for a group with allergies or restrictions — the bakery is vegan, gluten-free, soy free, nut free, kosher, and refined-sugar free. A mouthful in more ways than one.",
        "text": [
          {
            "type": "text",
            "value": "This bakery should be your go-to spot for a dietary restriction birthday celebration, and at all times you’ll find cookies, bars, cupcakes, and more available at their small South Street hub. You can place an order over the phone by looking at their website’s menu, or roll the dice and pop in to see what’s in store. Sweet Freedom even ships and delivers, making it impossible to pass up these sugary treats!"
          }
        ]
      },
      {
        "Name": "Giorgio on Pine",
        "Filters": "Gluten-free, Carnivore-friendly",
        "Dishes_to_try": "Flourless chocolate cake, gluten-free spaghetti and ziti",
        "Go_for": "A filling Italian meal with a group",
        "Something_to_note": "This BYOB italian restaurant is a big help to gluten-free eaters. With a quick mention to your waiter, a basket of gluten-free bread and dipping oil will be brought to the table. Munch on some gluten-free pizza and pasta and enjoy!",
        "text": []
      },
      {
        "Name": "Barra Rossa",
        "Filters": "Vegan, Dairy-free, Gluten-free, Carnivore-friendly",
        "Dishes_to_try": "Try their vegan hemp pasta pignoli, their taco ‘meat’ pizza, and their truffle Parmesan fries.",
        "Go_for": "Happy hour for their drink specials, and stay late for a dinner that pleases everyone.",
        "Something_to_note": "Barra Rossa truly has it all — vegan cheese, gluten-free penne pasta and pizza crust, and ‘normal food’ for your friends. Gluten-free items are very clearly marked on the menu, and there is an entire “plant based” section dedicated to making  lives easier.",
        "text": [
          {
            "type": "text",
            "value": "TK"
          }
        ]
      },
      {
        "Name": "Bareburger",
        "Filters": "Vegan, Dairy-free, Gluten-free, Carnivore-friendly",
        "Dishes_to_try": "From their expansive vegan menu, try the Duchess;  the Uptown fries; and a vegan milkshake. Carnivores, try the",
        "Go_for": "An Impossible Burger tasting with carnivore friends",
        "Something_to_note": "The menu is marked up to show which items are vegan and gluten-free, as well as which have nuts and GMOs. Their menu also clearly marks their celiac-safe gluten-free options, which include buns and a collard green wrap.",
        "text": [
          {
            "type": "text",
            "value": "Bareburger, an international burger chain whose Philly location has table service and a beer and wine menu, has one of the largest menus you’ll ever see - they claim it’s possible to create 81 million different burgers. Though they offer a large array of meat options as well -- bison and buttermilk-fried chicken, for example-- <a href=\"https://www.instagram.com/explore/locations/719969541546437/bareburger-philadelphia/\">vegans rave</a> about its separate vegan menu with options like vegan gouda, plant-based eggs, Beyond bratwurst, and five different types of vegan burgers (including both Impossible burgers and Beyond Meat burgers). Two of their most popular vegan dishes are the Duchess, an Impossible burger with garlic aioli, mushrooms, caramelized onions, baby kale and --get this-- smoked gouda, which mirrors the Duke burger on their non-vegan menu, and the crispy brussels sprouts (vegan and gluten-free; on the heavier side, as they are fried). Their emphasis on organic ingredients makes it a bit on the pricier end of the spectrum for burger joints, but most if not all of their food, including vegan options, is hearty and rich, and they have everything vegans usually miss out on, including coconut-and-hemp milk milkshakes."
          }
        ]
      },
      {
        "Name": "Bar Bombon",
        "Filters": "Vegan, Dairy-free, Gluten-free",
        "Dishes_to_try": "Philly steak empanadas; buffalo cauliflower tacos (gluten-free); jalapeno rellenos",
        "Go_for": "After-work happy hour - even with non-vegan friends (Mon- Fri 3pm-6pm)",
        "Something_to_note": "Ask your waiter to make items marked with an asterisk on the menu gluten-free.",
        "text": []
      },
      {
        "Name": "Bao-logy",
        "Filters": "Vegan, Dairy-free, Gluten-free, Carnivore-friendly",
        "Dishes_to_try": "Shi Fan (congee/ rice porridge) for breakfast; organic King Oyster Mushroom Gwa Boa (vegan), winner of the <a href=\"https://www.inquirer.com/food/starchefs-awards-philadelphia-chefs-curtis-atrium-20190319.html\">2019 StarChefs sustainability award</a>, for lunch; sweet potato donut holes for dessert",
        "Go_for": "Bring-your-own champagne brunch with an Asian twist",
        "Something_to_note": "Bao-logy marks up their menus so that customers know which items are vegan and which are gluten-free; however, as owner Judy Ni states, it is possible for cross-contamination to occur from airborne flour. For lactose-intolerant diners, all items on their menu can be made dairy-free, and the grand majority of them don’t have dairy in the first place.",
        "text": []
      },
      {
        "Name": "Charlie was a Sinner",
        "Filters": "Vegan, Dairy-free, Gluten-free",
        "Dishes_to_try": "For gluten-free diners, must-try dishes include ‘Our ricotta’; the spinach bakoula; and the chocolate pot de crème. Gluten-eaters, see <a href=\"https://www.inquirer.com/philly/food/20141019_Don_t_call_Charlie_s__quot_plant-based_cuisine_quot__vegan.html\">Craig LaBan’s recommendations</a>.",
        "Go_for": "A night out with friends.",
        "Something_to_note": "Tell your waiter about any allergies. The restaurant has full ingredient lists in the kitchen as well as soy-free and gluten-free menus. Everything on their gluten-free menu is Celiac safe, but if your gluten intolerance is mild rather than severe, more fried options are available to you as well (they don’t have a separate gluten-free fryer).",
        "text": [
          {
            "type": "text",
            "value": "Far from being a vegan-only enclave, this low-lit bar and restaurant from HipCityVeg and Bar Bombon owner Nicole Marquis attracts all different kinds of hip Philadelphians eager to taste creative cocktails like the spicy Fire Island and the ‘East of Eden.’ (So don’t forget to make reservations.)  Like the drinks, the flavors in the food are strong instead of subtle in small plates like the tofu-based ‘Our Ricotta’ with crunchy sourdough, the spicy Korean fried tofu on pickled cauliflower and the Moroccan creamed ‘spinach bakoula’ (gluten-free) with salty olives. You won’t leave feeling hungry."
          },
          {
            "type": "text",
            "value": "[Another quote I could substitute for the first two sentences: Charlie’s is a “casual, stylish piece in Midtown Village's gallery of nightlife options, strong on low-commitment nibbles and drinks for a youthful crossroads where attention spans and budgets are not large,” <a href=\"https://www.inquirer.com/philly/food/20141019_Don_t_call_Charlie_s__quot_plant-based_cuisine_quot__vegan.html\">Craig writes</a>.]"
          }
        ]
      },
      {
        "Name": "Strangelove’s",
        "Filters": "Vegan, Dairy-free, Carnivore-friendly",
        "Dishes_to_try": "Try their $15 weekday two-course lunch special with fried brussels sprouts or the vegetarian nachos with Daiya cheese as your first course and a <a href=\"https://www.inquirer.com/philly/food/20130825_Southern_comforts_and_intriguing_craft_beers.html\">LaBan-approved</a> Russian kale salad or vegan veggie burger with harissa mayo and cucumber slaw (all vegan and dairy-free). (Carnivore friends can get chicken on the salad.) And don’t leave out a draft beer.",
        "Go_for": "Quizzo at 9pm on Monday nights, or weekend brunch with ~free Mimosas~",
        "Something_to_note": "Strangelove’s menu is rare in that its vegan and vegetarian options nearly equal non-vegan-or-vegetarian in number. The menu is clearly marked to delineate between the two, and some dishes can be made dairy-free.",
        "Instagram": "<a href=\"https://www.instagram.com/p/B0D5x8yjET5/?utm_source=ig_web_copy_link\">https://www.instagram.com/p/B0D5x8yjET5/?utm_source=ig_web_copy_link</a>",
        "text": []
      },
      {
        "Name": "Zavino",
        "Filters": "Gluten-free, Carnivore-friendly",
        "Dishes_to_try": "The Diavolo pizza on a gluten-free crust; the spaghetti squash; and the gluten-free cheesecake.",
        "Go_for": "A slightly-fancier version of the college pizza + beer night out (replace beer with wine, pepperoni with prosciutto, and pop with blues).",
        "Something_to_note": "They don’t carry vegan cheese, but their pizzas can be made vegan and/or dairy free. They can make other items dairy-free, such as the brussels sprouts, spaghetti squash, the roasted cauliflower, the almond cake, and all of their salads. Their gluten-free crusts, however, contain milk.",
        "Instagram": "<a href=\"https://www.instagram.com/p/By5H8CcHJee/?utm_source=ig_web_copy_link\">https://www.instagram.com/p/By5H8CcHJee/?utm_source=ig_web_copy_link</a>",
        "text": [
          {
            "type": "text",
            "value": "Zavino, while known for its pizza, is not a pizza joint. The white marble tables, fully-stocked bar and antipasti station in the restaurant tell you immediately that though they serve reasonably priced pies, they also cater to those who seek  to try their $23 tasting board. Though they have very few vegan options, their spaghetti squash small plate, which might sound like something from a deprivation diet, has an incredibly hearty flavor from the sage, garlic, roasted pine nuts in its tomato sauce. “Surely these pies are better than 98 percent of the competition,” Craig LaBan wrote in 2010, but “the pizzas aren't even nearly the best things to eat at Zavino.” The pizza is a must-try for gluten-intolerant diners, however: at the University City location, you can watch a chef spin their made-on-site gluten-free crust behind the bar (fluffy with a crunch from the wood-fired oven, it’s known in the gluten-free community as the best crust in the city)."
          }
        ]
      },
      {
        "Name": "Front Street Cafe",
        "Filters": "Vegan, Dairy-free, Carnivore-friendly",
        "Dishes_to_try": "Front Street benedict with tofu scramble and mushroom scrapple (vegan, can be made gluten-free), <a href=\"https://www.inquirer.com/philly/food/20160228_Fishtown_s_Front_Street_Cafe_aims_higher_than_it_achieves.html\">as featured in Craig LaBan’s review</a>; chicken bites (gluten-free, dairy free); buffalo cauliflower (vegan, gluten-free); cheesecake (vegan and gluten-free)",
        "Go_for": "Boozy Sunday brunch date",
        "Something_to_note": "Their menu notes whether items contain dairy, fish, meat, etc., as well as which are gluten-free.",
        "text": []
      },
      {
        "Name": "Vedge",
        "Filters": "Vegan, Dairy-free, Gluten-free",
        "Dishes_to_try": "Mushroom carpaccio, wood roasted carrot (it has a ‘Reubenesque’ flavor, according to Craig LaBan, who <a href=\"https://www.inquirer.com/philly/columnists/craig_laban/vedge-best-restaurants-philadelphia-20171209.html\">awarded Vedge the  elusive four bells</a>), stuffed avocado, and rutabaga fondue (all dishes but the fondue are gluten-free)",
        "Go_for": "Dinner on a special occasion with foodie friends",
        "Something_to_note": "Vedge offers separate soy- and gluten-free menus for customers with allergies.",
        "text": []
      },
      {
        "Name": "V Street",
        "Filters": "Vegan, Dairy-free, Gluten-free",
        "Dishes_to_try": "Cauliflower ‘65,’  Peruvian potatoes (gluten-free), Falooda",
        "Go_for": "Boozy Saturday lunch date",
        "Something_to_note": "V Street offers soy-free and gluten-free menus to guests with dietary restrictions. They also can modify their menu to accommodate other allergies if you call in advance.",
        "text": [
          {
            "type": "text",
            "value": "You won’t see ‘tempeh sausage’ or ‘soy-based chicken’ on the menu at V Street, a plant-based, vegan restaurant and bar. James Beard-nominated chefs Rich Landau and Kate Jacoby opened V Street in 2014 as a lower-cost (but still pricey) offshoot of the wildly successful Vedge. They took inspiration from street foods around the world to create a menu that touches India (Cauliflower ‘65,’ made of crunchy papadum crackers and fried cauliflower florets in a spicy sauce), Peru (fried potato wedges with a spicy aioli), Jamaica (jerk tofu over creamy sweet potato aioli), Ethiopia and Eritrea (berbere broccoli), and Iran (Falooda, their take on the traditional Persian rosewater ice cream dish). In his glowing <a href=\"https://www.inquirer.com/philly/food/20150118_LaBan_V_Street_Vedge_vegan_Landau.html\">three-bell review of V Street</a>, Inquirer food critic Craig LaBan writes, ‘The way Rich Landau sees it, with animal products off his vegan table, he can't cook with half the ingredients that other chefs do: ‘So why limit ourselves to one ethnicity?’”"
          }
        ]
      },
      {
        "Name": "White Dog Cafe",
        "Filters": "Vegan, Dairy-free, Gluten-free, Carnivore-friendly",
        "Dishes_to_try": "Mushroom soup; pan-roasted duck breast; medjool date and almond tart (dairy-free)",
        "Go_for": "Martinis, fancy brunch",
        "Something_to_note": "White Dog offers vegetarian and vegan menus upon request.",
        "text": []
      },
      {
        "Name": "Luhv Vegan Deli",
        "Filters": "Vegan, Dairy-free, Gluten-free",
        "Dishes_to_try": "reuben sandwich (vegan); energy soup (vegan and gluten-free); deli cheeses (vegan and gluten-free)",
        "Go_for": "A quick, healthy lunch",
        "Something_to_note": "The deli offers gluten-free sandwich bread, specially made to be vegan by local staple <a href=\"https://www.inquirer.com/philly/food/20120315_A_rare_gluten-free_bread_bakery.html\">Taffet’s</a><a href=\"https://www.inquirer.com/philly/food/20120315_A_rare_gluten-free_bread_bakery.html\"> Bakery</a>, for an extra $2. All of their burgers and soups are gluten-free, but the seitan, chicken salad, sausage, and all cold cuts contain gluten.",
        "text": [
          {
            "type": "text",
            "value": "Though Luhv Vegan Deli has only been <a href=\"https://www.inquirer.com/philly/blogs/the-insider/luhv-food-vegan-deli-reading-terminal-market-20180914.html\">open in Reading Terminal Market</a> for a year, <a href=\"https://www.inquirer.com/philly/food/20161006_Luhv_Food_Philly-area_family_puts_money_on_vegan_food.html\">the family behind it has operated since 2016</a>, when they began selling their black bean and plantain burgers at local markets. Now available up and down the east coast (in markets from Connecticut to Virginia), the burger doesn’t crumble like other meatless burgers, and it even earned a thumbs up from Craig Laban, who called it “a well-crafted mouthful of sweet and spicy.” At the deli, it comes with remarkably smoky gouda, sauteed mushrooms and ‘mushroom mayo.’ Another specialty is their gluten-free energy soup, a warming blend of beans, kale, quinoa, seaweed, and flax seed."
          }
        ]
      },
      {
        "Name": "Fox & Son Fancy Corndogs",
        "Filters": "Vegan, Dairy-free, Gluten-free, Carnivore-friendly",
        "Dishes_to_try": "Banana funnel cake (vegan and gluten-free); vegan corn dog with royale sauce (a sauce similar to Thousand Island dressing); ‘fancy’ sweet potato battered corndog with chorizo (gluten-free).",
        "Go_for": "A rare indulgence in childhood memories, if you’re gluten-intolerant",
        "Something_to_note": "For those who eat meat but not dairy, you can order a regular corndog with vegan batter. They have many dairy-free extras like Daiya cheese that you can use to customize your order.",
        "text": [
          {
            "type": "text",
            "value": "Fox & Sons Fancy Corndogs, a carnival-esque food stand that <a href=\"https://www.inquirer.com/philly/blogs/the-insider/Fox-and-son-corndog-stand-is-coming-to-Reading-Terminal-Market.html\">opened at Reading Terminal</a> in Feb. 2017, struck a happy medium when they found a batter for their fried foods that happened to be gluten-free. The owners were inspired by the texture of Japanese and Chinese pastries, co-owner Rebecca Foxman said, which typically use a blend of rice flour and corn starch. Their entirely gluten-free menu includes corn dogs, fried broccoli bites, fried cheese curds, funnel cake, and poutine (including a vegan option). The vegan iteration of their funnel cake, the owners report, also saves food waste: they use ripe bananas that produce stands at Reading Terminal would get rid of at the end of the day to replace the buttermilk and eggs in their traditional funnel cake recipe. The store also <a href=\"https://www.rachaelrayshow.com/articles/check-out-fancy-corn-dogs-fox-son-philly\">recently appeared on the Rachael Ray Show</a>."
          }
        ]
      },
      {
        "Name": "Blackbird Pizzeria",
        "Filters": "Vegan, Dairy-free, Gluten-free",
        "Dishes_to_try": "Seitan cheesesteak, haymaker pizza, their most popular pizza, complete with Violife cheese, oregano, red onions, and seitan sausage; and habanero buffalo wings",
        "Go_for": "A lively dinner among Philly’s vegan crowd",
        "Something_to_note": "Blackbird does not carry gluten-free bread or crusts, so the only options for gluten-free diners there are the arugula and green salads.",
        "Instagram": "<a href=\"https://www.instagram.com/p/B0GXZyppJvd/?utm_source=ig_web_copy_link\">https://www.instagram.com/p/B0GXZyppJvd/?utm_source=ig_web_copy_link</a>",
        "text": [
          {
            "type": "text",
            "value": "Blackbird Pizzeria, an all-vegan BYOB bar food joint, is a well-recognized staple for Philadelphia vegans -- its seitan cheesesteak earned it the title of Winner of the <a href=\"https://www.inquirer.com/philly/blogs/v-for-vegan/Blackbird-squeaks-past-challenger-Wiz-Kid-to-retain-vegan-cheesesteak-title.html\">Best Vegan Cheesesteak in Philly</a> contest in both 2016 and 2017, and it also made<a href=\"https://www.inquirer.com/philly/blogs/food_department/Philly-shops-wings-are-ranked-among-best-in-US.html\"> the top 10 vegan wings in the U.S. in 2014</a>. Rather than using the ubiquitous Daiya cheese, a commercially available vegan cheese made of coconut oil and tapioca, owner Mark Mebus uses Violife cheese, as the Inquirer <a href=\"https://www.inquirer.com/philly/food/vegan-cheese-is-undergoing-a-revolution-in-philly-and-beyond-20180502.html\">reported in 2018</a>. According to Mebus, Violife is ‘the most meltable and convincing plant-based cheese he has yet discovered.’ He would know - he was <a href=\"https://www.gridphilly.com/grid-magazine/2014/3/19/blackbird-pizzeria-serves-up-100-percent-vegan-pizzas.html\">part of the opening team</a> for a past endeavor, Horizons, by Philly vegan scene pioneers, Rich Landau and Kate Jacoby."
          }
        ]
      },
      {
        "Name": "Grindcore House",
        "Filters": "Vegan, Dairy-free",
        "Dishes_to_try": "Dottie’s donuts, scallion cream cheese, kropotkin sandwich (all vegan)",
        "Go_for": "Coffee with a side of communist literature",
        "Something_to_note": "The cafe offers bottomless drip coffee for the day for only $3.35.",
        "text": [
          {
            "type": "text",
            "value": "Grindcore House is the most hardcore all-vegan cafe you’ll find in Philadelphia. Heavy metal music greets visitors who step into the store, which has a glass case full of vegan treats including the popular Dottie’s donuts -- and vegan pastries are hard to find. Deeper in the cafe’s space is an extensive library of radical literature.  Their menu features many bagels, sandwiches and salads, like the popular kropotkin, which includes field roast, pesto, mixed greens, roasted red peppers, onion, and vegan mayonnaise on ciabatta, and their gourmet vegan cream cheeses, including olive, jalapeno and scallion."
          }
        ]
      },
      {
        "Name": "Slice",
        "Filters": "Vegan, Dairy-free, Gluten-free, Carnivore-friendly",
        "Dishes_to_try": "Truffle pizza (can be made gluten free and vegan), gluten-free Fig pizza, vegan lemon bar, gluten-free tiramisu",
        "Go_for": "Late-night munchies",
        "Something_to_note": "Slice offers gluten-free crusts and vegan cheese. However, just because it’s on a gluten free crust doesn’t mean a pizza is gluten-free -- make sure to check toppings with the cashier or a manager before ordering. Another note is that their gluten-free pizzas only come in what some would consider personal-pizza size (10 inches, 6 small slices). Oh, and you can make your pizza heart-shaped (if it isn’t gluten free). Just ask.",
        "text": [
          {
            "type": "text",
            "value": "At this relaxed BYOB with counter service, don’t expect to be confined to the salads section (though they have some good options, like the kale + apple). They offer creative pizzas like the popular truffled ribeye (mozzarella ribeye, caramelized onions, white truffle oil) as well as calzones and strombolis. As for special options, unlike some pizza places, they don’t skimp on the Daiya cheese, and the gluten-free pizza, while small (10”), is a great option for a pizza that’s less heavy (and won’t kill your stomach, if you have a gluten sensitivity). Most of their business comes from delivery."
          }
        ]
      }
    ]
  }
}