{
  "intro": [
    {
      "type": "text",
      "value": "Philadelphia, home of the cheesesteak, the soft pretzel, and[ ](https://readingterminalmarket.org/merchant/bassetts-ice-cream/)[America’s ice cream maker](https://readingterminalmarket.org/merchant/bassetts-ice-cream/), may not seem like the most welcoming place to the dietary-restricted eater — people who must pass on pizza, go without grilled cheese, or abstain from asada. We feel your pain."
    },
    {
      "type": "text",
      "value": "But Philly is actually a haven for this crowd — it’s also home to a heap of vegan cheesesteaks ([enough to hold a contest](https://www.inquirer.com/philly/food/20160324_All_the_dish_from_the_3rd_annual_Best_Vegan_Cheesesteak_in_Philly_contest.html)), gluten-free cupcakes, and oat-milk options. Whatever flavor of dietary restriction you have, the city has options for you, and some are so compellingly delicious, your omnivorous friends will join you without being cajoled."
    },
    {
      "type": "text",
      "value": "**Allergy note**: While the gluten-free label signifies restaurants with menu items that exclude ingredients containing gluten, we can’t guarantee that these restaurants entirely avoid cross-contamination from shared prep surfaces and airborne allergens. If you have a severe intolerance or allergy, please notify the restaurant before you order."
    },
    {
      "type": "text",
      "value": "**How to use our filters**:"
    },
    {
      "type": "text",
      "value": "Select as many filters as you like to customize your list."
    }
  ],
  "restaurants-list": {
    "restaurants": [
      {
        "Name": "Goldie",
        "Filters": "Vegan, Dairy-free",
        "Instagram": "https://www.instagram.com/p/By8ATUxgcip/?igshid=1ppe682139sfc",
        "Go_for": "Mid-afternoon snack or a quick, casual dinner.",
        "text": [
          {
            "type": "text",
            "value": "Owned by Michael Solomonov and Steve Cook — the same team behind Zahav, Federal Donuts, and Abe Fisher — Goldie is 100 percent vegan and kosher and exceptionally accommodating of dietary restrictions. The menu is small but includes fluffy-crisp falafel served in pillowy pita bread (or over chopped salad), shawarma-spiced fries, and [addictive dairy-free tehina milkshakes](https://twitter.com/craiglaban/status/850036488683347969?lang=en). Besides the eat-in space on Sansom Street, find Goldie at the Whole Foods’ food court on Pennsylvania Avenue as well as UPenn food hall Franklin’s Table."
          }
        ]
      },
      {
        "Name": "Tattooed Mom",
        "Address": "530 South St., Philadelphia, PA 19147",
        "Filters": "Vegan, Dairy-free",
        "Instagram": "https://www.instagram.com/p/ByOU-kSByXf/?igshid=9ih51aa66shg",
        "Go_for": "A playful and affordable night out, Meatless Mondays",
        "text": [
          {
            "type": "text",
            "value": "A South Street staple since 1997, Tattooed Mom’s kitchen turns out bar food for vegans and for carnivores alike, making it the perfect hangout for eaters of all stripes. The vegan menu is thanks, in part, to how staff members’ own diets have evolved. It has plenty of bar food that people with dietary restrictions can enjoy — complete with specials like Meatless Mondays (half off the full plant-based menu) and taco Tuesdays. It also boasts a daily late night happy hour from 10-11 p.m., perfect for a late night snack and drink."
          }
        ]
      },
      {
        "Name": "HipCityVeg",
        "Filters": "Vegan, Dairy-free, Gluten-free",
        "Go_for": "A quick vegan bite",
        "Instagram": "https://www.instagram.com/p/BzycecAF6E5/?igshid=1ll528dabi6aq",
        "text": [
          {
            "type": "text",
            "value": "Philly vegan restaurateur Nicole Marquis opened the first fast-casual burger joint HipCityVeg in 2012. HipCityVeg serves up creamy vegan and lactose-free sauces: filling, crunchy salads with creamy caesar dressing, fried “chick’n” sandwiches with peppercorn ranch, garlic aioli, or chipotle crema, and curry tofu wraps with cumin raita. But the restaurant’s fast expansion, with four Philly locations, two locations in the Pa. suburbs and Washington, D.C., is a testament to its broad appeal."
          }
        ]
      },
      {
        "Name": "The Tasty",
        "Filters": "Vegan, Dairy-free, Gluten-free",
        "Go_for": "Breakfast or lunch with a no-frills, classic diner vibe",
        "text": [
          {
            "type": "text",
            "value": "Co-owner Sofia Baltopoulos and her business partner opened The Tasty three years ago, after noticing that none of the area’s diners had more than one or two vegan options. The Tasty is 100% vegan, and also offers an additional gluten-free menu. The South Philly spot has custom coffee drinks, colorful doughnuts and pastries and a classic diner vibe of swivel bar chairs and homey booths. They serve all the classics, veganized: cheesy omelets and scrambles, Tex-Mex breakfast burritos, pancakes, French toast, and waffles,which stand up to regular diner food."
          }
        ]
      },
      {
        "Name": "Dim Sum House by Jane G’s",
        "Filters": "Vegan, Dairy-free, Gluten-free, Carnivore-friendly",
        "Go_for": "A late-night group hangout",
        "text": [
          {
            "type": "text",
            "value": "Opened by the owners of the popular Jane G’s Authentic Sichuan, Dim Sum House by Jane G’s opened in 2016. The restaurant has a laid-back, but sleek, design, with old Shanghai-inspired decor, a pool table, a full bar, two dining rooms and a private dining space. Almost everything here is dairy-free, plenty is gluten-free, and there are many unique Cantonese- and Shanghai-inspired dim sum dishes that are vegan. They have happy hour from 5-7 p.m. daily, and are open 1 a.m. every day except Monday."
          }
        ]
      },
      {
        "Name": "P.S. & Co.",
        "Filters": "Vegan, Dairy-free, Gluten-free",
        "Go_for": "Brunch",
        "text": [
          {
            "type": "text",
            "value": "Rittenhouse hotspot P.S. and Co. is [a good bet](https://www.inquirer.com/philly/blogs/the-insider/Vegan-PS--Co-opens-in-Rittenhouse.html) for those with dietary restrictions: the  entire menu is plant-based and gluten-free. Andrea Kyan founded the restaurant after she went vegan in 2007, and found a lack of sweets to eat — so she started experimenting. The restaurant avoids what they call “[unhealthful forms of soy and pea protein](https://puresweets.com/pages/faq),” so they don’t make or sell any processed meat substitutes. The space is airy and photogenic but not the best bet for large groups — it’s a better bet for a few friends. It’s packed for brunch on weekends, so reservations are a plus."
          }
        ]
      },
      {
        "Name": "Sweet Freedom Bakery",
        "Filters": "Vegan, Dairy-free, Gluten-free",
        "Go_for": "A major sweet fix",
        "text": [
          {
            "type": "text",
            "value": "Sweet Freedom brands itself as Philadelphia’s first all-around dietary-restriction-friendly bakery. The bakery is vegan, gluten-free, soy free, nut free, kosher, and refined-sugar free. And, somehow, [this quiet South Street joint](https://www.inquirer.com/philly/entertainment/20101121_Sweet_Freedom_bakery_on_South_Street__vegan_and_gluten-free.html) manages to make you forget what’s not in the food. Sweet Freedom replaces dairy, animal, and gluten products with a variety of ingredients, many of them coconut products, — oil, milk, and sugar — as well as sorghum flour, potato starch and rice flour. Sweet Freedom was featured on the Food Network’s Cupcake Wars, and earned stellar reviews for some of their clever creations. The bakery takes orders by phone, and both ships and delivers."
          }
        ]
      },
      {
        "Name": "Giorgio on Pine",
        "Filters": "Gluten-free, Carnivore-friendly",
        "Go_for": "A filling Italian meal with a group",
        "text": [
          {
            "type": "text",
            "value": "This cozy BYOB, at the corner of Pine and S. Juniper Streets, lets you eat Italian but skip the gluten. The restaurant offers both a regular menu and a menu with gluten-free substitutions, so there’s a variety of appetizers, pizzas and pasta dishes that suit everyone’s needs. Along with the pizza and pasta, they offer gluten-free classics like mussels, calamari, a prosciutto platter, ribeye with mushroom sauce and veal prosciutto. Even the breadcrumbs in the kale salad and the Parmesan-crusted chicken breast are gluten-free. There are homemade desserts as well, like their flourless chocolate cake, cannoli, and creme bruleé. Make sure to book a reservation before you go."
          }
        ]
      },
      {
        "Name": "Barra Rossa",
        "Filters": "Vegan, Dairy-free, Gluten-free, Carnivore-friendly",
        "Go_for": "Happy hour drink specials, or a late dinner",
        "text": [
          {
            "type": "text",
            "value": "The upscale Italian restaurant and bar offers a vegan [happy hour menu](https://www.inquirer.com/food/michael-klein/barra-rossa-philadelphia-happy-hour-jefferson-20190618.html) on Wednesday nights from 4 to 6 p.m, and a bustling atmosphere with friendly bartenders and servers to go along with it. Hit the half-price Monday-night pizza deal for the thin-crust vegan taco pizza (made with coconut-based Violife vegan cheese and Impossible “meat”). If you’re so inclined, try it gluten free, too."
          }
        ]
      },
      {
        "Name": "Bareburger",
        "Filters": "Vegan, Dairy-free, Gluten-free, Carnivore-friendly",
        "Go_for": "An Impossible Burger",
        "text": [
          {
            "type": "text",
            "value": "The Philly location of the international burger chain has one of the largest menus you’ll ever see (they claim it’s possible to create 81 million different burgers). Though Bareburger offers an array of meat options — bison and buttermilk-fried chicken, for example — [vegans rave](https://www.instagram.com/explore/locations/719969541546437/bareburger-philadelphia/) about its separate menu that features plant-based “eggs,” Beyond bratwurst, and five types of vegan burgers (including Impossible and Beyond Meat). A popular choice is the Duchess, an Impossible burger with garlic aioli, mushrooms, caramelized onions, baby kale and smoked vegan “gouda.” Bareburger’s emphasis on organic ingredients makes it a bit on the pricier side for burger joints."
          }
        ]
      },
      {
        "Name": "Bar Bombon",
        "Filters": "Vegan, Dairy-free, Gluten-free",
        "Go_for": "After-work happy hour Mon- Fri 3-6 p.m.",
        "text": [
          {
            "type": "text",
            "value": "Nicole Marquis' Puerto bustling corner bar-restaurant near Rittenhouse Square is only a few doors from her original eatery, the casual HipCityVeg. Bar Bombon is similarly plant-based, and the 3 p.m. happy hour start may inspire you to knock off early from work for drinks."
          }
        ]
      },
      {
        "Name": "Bao-logy",
        "Filters": "Vegan, Dairy-free, Gluten-free, Carnivore-friendly",
        "Go_for": "BYOB egg-and-toastless brunch (on Saturday, it’s closed Sunday)",
        "text": [
          {
            "type": "text",
            "value": "With iPad ordering and angular booths, this modern Taiwanese street food BYOB serves up a budget-friendly filling meal. As the name implies, Baology knows how to do gwa bao: the fluffy buns contain a variety of fillings, including King Oyster mushrooms (which won the [2019 StarChefs sustainability award](https://www.inquirer.com/food/starchefs-awards-philadelphia-chefs-curtis-atrium-20190319.html)). The ruen bing, a gluten-free wrap made of thin rice paper and filled with meat or bean curd, hoisin sauce and peanut powder, is also a specialty, as well as their tender dumplings and Forbidden Rice bento boxes. For lactose-intolerant diners, all items on their menu can be made dairy-free. Closed Sundays."
          }
        ]
      },
      {
        "Name": "Charlie was a Sinner",
        "Filters": "Vegan, Dairy-free, Gluten-free",
        "Go_for": "A night out with friends.",
        "text": [
          {
            "type": "text",
            "value": "Far from being a vegans-only enclave, this low-lit bar and restaurant from HipCityVeg and Bar Bombon owner Nicole Marquis those eager to taste creative cocktails like the spicy Road Less Traveled (single barrel bourbon, tangerine marmalade, amaro, Lillet Rouge and cherry bitters) and the East of Eden (with bourbon, tea-infused Dolin blanc, lillet and fig). Like the drinks, the food is strong on flavor in small plates like the tofu-based “ricotta” with crunchy sourdough, the spicy Korean fried tofu with pickled cauliflower, and the gluten-free Moroccan creamed spinach bakoula with salty olives. Come hungry."
          }
        ]
      },
      {
        "Name": "Strangelove’s",
        "Filters": "Vegan, Dairy-free, Carnivore-friendly",
        "Go_for": "Quizzo at 9pm on Monday nights, or weekend brunch.",
        "Instagram": "https://www.instagram.com/p/B0D5x8yjET5/?utm_source=ig_web_copy_link",
        "text": [
          {
            "type": "text",
            "value": "With weekly events like quizzo Strangelove’s has the feel of a quirky neighborhood bar. They serve pub-style food, like fried calamari and burgers, with more vegan options than your typical beer joint. Try the $15 weekday two-course lunch special with fried Brussels sprouts or the vegetarian nachos with Daiya cheese or the Craig [LaBan-approved](https://www.inquirer.com/philly/food/20130825_Southern_comforts_and_intriguing_craft_beers.html) Russian kale salad, or vegan veggie burger. There’s also a weekend brunch with plenty of allergy- and vegan- friendly options."
          }
        ]
      },
      {
        "Name": "Zavino",
        "Filters": "Gluten-free, Carnivore-friendly",
        "Go_for": "A slightly-fancier version of a pizza + beer night out.",
        "Instagram": "https://www.instagram.com/p/By5H8CcHJee/?utm_source=ig_web_copy_link",
        "text": [
          {
            "type": "text",
            "value": "Zavino, while known for its pizza, is not a regular pizza joint. The white marble tables, fully-stocked bar and antipasti station signal that while they serve reasonably priced pies, they also cater to those who would seek out the pricier tasting board. At the University City location, you can watch a chef spin the gluten-free crust behind the bar (fluffy but crunchy and baked in a wood-fired oven). They don’t carry vegan cheese, but their pizzas can be made vegan and/or dairy free. (They can make other items dairy-free.) Their gluten-free crusts, however, contain milk."
          }
        ]
      },
      {
        "Name": "Front Street Cafe",
        "Filters": "Vegan, Gluten-free, Dairy-free, Carnivore-friendly",
        "Go_for": "Boozy Sunday brunch",
        "text": [
          {
            "type": "text",
            "value": "Just a block from the Girard stop on the El, you can’t miss Front Street Cafe, a sprawling, rustic-modern restaurant that’s a little bit of everything: coffee shop, bar, farm-to-table restaurant. In the warmer months, you can sit in the garden and sip a smoothie and some iced tea from the outdoor bar, and in the winter, come to the bar for beer, wine and fruit- and herb-inspired cocktails. They serve New American fare with an emphasis on vegetarian-, vegan- and allergy- friendly dishes like vegan waffle bites, their Front Street Benedict with tofu scramble and mushroom scrapple, and eggplant terrine. (They even have vegan, gluten-free mac and cheese with parmesan and mushroom “bacon.”)"
          }
        ]
      },
      {
        "Name": "Vedge",
        "Filters": "Vegan, Dairy-free, Gluten-free",
        "Go_for": "Dinner on a special occasion with foodie friends",
        "text": [
          {
            "type": "text",
            "value": "Awarded [the elusive four bells](https://www.inquirer.com/philly/columnists/craig_laban/vedge-best-restaurants-philadelphia-20171209.html) by Craig LaBan, the all-vegan bar and restaurant Vedge is a national landmark of vegan cuisine. “More than enough carnivore minds have been blown” by its seasonally rotating menu, which features small plates with intense flavors that are ordered to share as well as creative drinks. It’s a fine dining experience, as you enjoy your multiple courses and dessert in the spacious, modern dining room, but don’t expect to find seats unless you book at least a week in advance. Vedge offers separate soy- and gluten-free menus and can accommodate other allergies if diners call ahead."
          }
        ]
      },
      {
        "Name": "V Street",
        "Filters": "Vegan, Dairy-free, Gluten-free",
        "Go_for": "Boozy Saturday lunch date",
        "text": [
          {
            "type": "text",
            "value": "You won’t see ‘tempeh sausage’ or ‘soy-based chicken’ on the menu at vegan bar/restaurant V Street. James Beard-nominated chefs Rich Landau and Kate Jacoby opened the place in 2014 as a lower-cost (but still pricey) offshoot of the wildly successful Vedge. They took inspiration from street foods around the world to create a menu that touches Southeast Asias, South American, Caribbean and African subcontinental flavors. V Street offers soy-free and gluten-free menus to guests with dietary restrictions. They also can modify their menu to accommodate other allergies if you call in advance."
          }
        ]
      },
      {
        "Name": "White Dog Cafe",
        "Filters": "Vegan, Dairy-free, Gluten-free, Carnivore-friendly",
        "Go_for": "Martinis, celebratory brunch",
        "text": [
          {
            "type": "text",
            "value": "White Dog Cafe is more than just a kitschy, canine-themed bistro. This upscale standby, which has been around for nearly four decades and has multiple suburban locations,[ expanded](https://www.inquirer.com/philly/blogs/the-insider/white-dog-cafes-expansion-is-quite-fetching-20171201.html) to become one of the largest restaurants in UCity. The 12-seat parlor bar and an elegant staircase leading to the second level complement the plush booths and lush greenery that fill the restaurant. White Dog offers vegetarian and vegan menus upon request."
          }
        ]
      },
      {
        "Name": "Luhv Vegan Deli",
        "Filters": "Vegan, Dairy-free, Gluten-free",
        "Go_for": "A quick, healthy lunch",
        "text": [
          {
            "type": "text",
            "value": "Though Luhv Vegan Deli has only been [open in Reading Terminal Market](https://www.inquirer.com/philly/blogs/the-insider/luhv-food-vegan-deli-reading-terminal-market-20180914.html) since 2018, [the family behind it has been cooking for customers since 2016](https://www.inquirer.com/philly/food/20161006_Luhv_Food_Philly-area_family_puts_money_on_vegan_food.html ), when they began selling black bean and plantain burgers at local markets. Now available up and down the east coast (in markets from Connecticut to Virginia), the burger doesn’t crumble like other meatless burgers. At the deli, it comes with smoky vegan “gouda,” sauteed mushrooms and “mushroom mayo.” Another specialty is their gluten-free energy soup, a warming blend of beans, kale, quinoa, seaweed, and flax seed. The deli offers gluten-free sandwich bread, specially made to be vegan by local staple [Taffet’s Bakery](https://www.inquirer.com/philly/food/20120315_A_rare_gluten-free_bread_bakery.html), for an extra $2. All of their burgers and soups are gluten-free, but the seitan, chicken salad, sausage, and all cold cuts contain gluten."
          }
        ]
      },
      {
        "Name": "Fox & Son Fancy Corndogs",
        "Filters": "Vegan, Dairy-free, Gluten-free, Carnivore-friendly",
        "Go_for": "A rare indulgence in childhood memories",
        "text": [
          {
            "type": "text",
            "value": "Fox & Sons Fancy Corndogs, a carnival-esque food stand that [opened at Reading Terminal](https://www.inquirer.com/philly/blogs/the-insider/Fox-and-son-corndog-stand-is-coming-to-Reading-Terminal-Market.html) in Feb. 2017, struck a happy medium when they found a batter that happened to be gluten-free. The owners were inspired by the texture of Japanese and Chinese pastries, co-owner Rebecca Foxman says, which typically uses a blend of rice flour and corn starch. Their entirely gluten-free menu includes corn dogs, fried broccoli bites, fried cheese curds, funnel cake, and poutine (including a vegan option). The vegan funnel cake also saves food waste: they use ripe bananas that produce stands at Reading Terminal toss at the end of the day to replace the buttermilk and eggs in their traditional funnel cake recipe. The store also [appeared on the Rachael Ray Show](https://www.rachaelrayshow.com/articles/check-out-fancy-corn-dogs-fox-son-philly)."
          }
        ]
      },
      {
        "Name": "Blackbird Pizzeria",
        "Filters": "Vegan, Dairy-free",
        "Go_for": "A lively dinner among Philly’s vegan crowd",
        "Instagram": "https://www.instagram.com/p/B0GXZyppJvd/?utm_source=ig_web_copy_link",
        "text": [
          {
            "type": "text",
            "value": "Blackbird Pizzeria, an all-vegan BYOB is a well-recognized staple for Philadelphia vegans. Its seitan cheesesteak won the [Best Vegan Cheesesteak in Philly](https://www.inquirer.com/philly/blogs/v-for-vegan/Blackbird-squeaks-past-challenger-Wiz-Kid-to-retain-vegan-cheesesteak-title.html) title in 2016 and 2017, and the spot also made[ the top 10 vegan wings in the U.S. in 2014](https://www.inquirer.com/philly/blogs/food_department/Philly-shops-wings-are-ranked-among-best-in-US.html). Their most popular pizza, the haymaker, comes with Violife cheese, oregano, red onions, and seitan sausage. Rather than using the ubiquitous Daiya cheese, owner Mark Mebus uses Violife brand, which he says is “the most meltable and convincing plant-based cheese” he has yet discovered. Mebus was [part of the opening team](https://www.gridphilly.com/grid-magazine/2014/3/19/blackbird-pizzeria-serves-up-100-percent-vegan-pizzas.html) for Horizons, alongside Philly vegan scene pioneers Rich Landau and Kate Jacoby."
          }
        ]
      },
      {
        "Name": "Grindcore House",
        "Filters": "Vegan, Dairy-free",
        "Go_for": "Coffee with a side of communist literature",
        "text": [
          {
            "type": "text",
            "value": "Grindcore House is the most hardcore all-vegan cafe you’ll find in Philadelphia. Heavy metal music greets visitors who step into the store, which has a glass case full of vegan treats — including the popular Dottie’s Donuts. Deeper in the cafe’s space is an extensive library of radical literature. Their menu features many bagels, sandwiches and salads, like the popular kropotkin, which includes field roast, pesto, mixed greens, roasted red peppers, onion, and vegan mayonnaise on ciabatta, as well as their vegan cream cheeses, including olive, jalapeño and scallion."
          }
        ]
      },
      {
        "Name": "Slice",
        "Filters": "Vegan, Dairy-free, Gluten-free, Carnivore-friendly",
        "Go_for": "Late-night munchies",
        "text": [
          {
            "type": "text",
            "value": "At this relaxed BYOB with counter service, don’t expect to be confined to the salads section (though they have some good options, like the kale and apple). They offer creative pizzas as well as calzones and strombolis. Unlike some pizza places, they don’t skimp on the Daiya cheese. Oh, and you can make your pizza heart-shaped on demand (but only if it isn’t gluten-free). Make sure to check the gluten status of toppings with the cashier or a manager before ordering. The gluten-free pizzas only come personal-pizza size (10 inches, 6 small slices)."
          }
        ]
      }
    ]
  }
}